In [167]:
import pandas as pd
from pymystem3 import Mystem
from collections import Counter
m = Mystem()

ModuleNotFoundError: No module named 'pymystem3'

In [2]:
df = pd.DataFrame({'name' : ['Earth', 'Moon', 'Mars'],
                   'mass_to_earth' : [1, 0.606, 0.107],
                   'three' : ['a', 'a', 'b']

                   })

In [3]:
df

    name  mass_to_earth three
0  Earth          1.000     a
1   Moon          0.606     a
2   Mars          0.107     b

Получаем новый датафрейм, в каждой строке третий столбец = а:

In [4]:
a = df[df['three'] == 'a']
print(type(a))
a

<class 'pandas.core.frame.DataFrame'>

    name  mass_to_earth three
0  Earth          1.000     a
1   Moon          0.606     a

в

Присваиеваем всему датафрейму значение - получаем заполнение всех столбцов в подходящих ячейках новым значением:

In [5]:
df2 = df.copy()
df2[df2['three'] == 'a'] = 'c'
df2

   name mass_to_earth three
0     c             c     c
1     c             c     c
2  Mars         0.107     b

In [6]:
type(df2['three'])
df2['three']

0    c
1    c
2    b
Name: three, dtype: object

проверяет весь столбец на соответствие равенству построчно:

In [7]:
df2['three'] == 'c'

0     True
1     True
2    False
Name: three, dtype: bool

Фильтруем исходный датафрейм по условию и берем только третий столбец из каждой строки, получаем Series:

In [8]:
b = df[df['three'] == 'a']['three']
print(b)
type(b)

0    a
1    a
Name: three, dtype: object

pandas.core.series.Series

Попытаемся присвоить значения только к определенным столбцам в строках, соответствующих критерию. Получаем ошибку. 
Полагаю, что изменять Series невозможно, т.к. она является частью ДатаФрейма, а это бы привело к конфликту.

In [9]:
df2[df2['three'] == 'c']['three'] = 'd'
print(df2)

   name mass_to_earth three
0     c             c     c
1     c             c     c
2  Mars         0.107     b

<ipython-input-9-74ab582d86f1>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2[df2['three'] == 'c']['three'] = 'd'

так тоже можно обратиться к ячейке. столбец 'three' и строка с индексом 2:

In [11]:
print(df2['three'][2])
print(type(df2['three'][2]))

b
<class 'str'>

пробуем изменить ячейку по такому доступу: получается

In [12]:
df2['three'][2] = '88'
df2

   name mass_to_earth three
0     c             c     c
1     c             c     c
2  Mars         0.107    88

In [16]:
print(type(df.loc[df['three'] == 'a'])) # делаем датафрейм из всех строк, в которых третий столбец = а
df.loc[df['three'] == 'a']

<class 'pandas.core.frame.DataFrame'>

    name  mass_to_earth three
0  Earth          1.000     a
1   Moon          0.606     a

In [14]:
zx = df.loc[df.loc[:,'three']=='a', 'name'] # берем только один столбец из датафрейма, где третий столбец = а, получаем Series. 
                                            # эта и следующая форма записи взаимозаменяемы
print(zx)
type(zx)

0    Earth
1     Moon
Name: name, dtype: object

pandas.core.series.Series

In [15]:
zy = df.loc[df.loc[:,'three']=='a']['name'] # эта и предыдущая форма записи взаимозаменяемы
print(zy)
type(zy)

0    Earth
1     Moon
Name: name, dtype: object

pandas.core.series.Series

In [17]:
zz = df.loc[df.loc[:,'three']=='a'] # берем все строки, соответствующие условию, получаем ДатаФрейм
print(zz)
type(zz)

    name  mass_to_earth three
0  Earth          1.000     a
1   Moon          0.606     a

pandas.core.frame.DataFrame

In [18]:
zz2 = df[df['three'] == 'a'] # тоже получаем ДатаФрейм
print(zz2)
print(type(zz2))

    name  mass_to_earth three
0  Earth          1.000     a
1   Moon          0.606     a
<class 'pandas.core.frame.DataFrame'>

In [19]:
zz_2 = df.loc[df.loc[:,'three']=='a']['name'] # а так получаем уже Series
print(zz_2)
print(type(zz_2))

0    Earth
1     Moon
Name: name, dtype: object
<class 'pandas.core.series.Series'>

In [20]:
zz2_2 = df[df['three'] == 'a']['name'] # тут тоже Series
print(zz2_2)
print(type(zz2_2))

0    Earth
1     Moon
Name: name, dtype: object
<class 'pandas.core.series.Series'>

In [21]:
zzz = df['three'] # получаем Series, как и в следующем синтаксисе
print(zzz)
print(type(zzz))

0    a
1    a
2    b
Name: three, dtype: object
<class 'pandas.core.series.Series'>

In [22]:
zzx = df.loc[:,'three'] # получаем Series, как и в предыдущем ситаксисе
print(zzx)
print(type(zzx))

0    a
1    a
2    b
Name: three, dtype: object
<class 'pandas.core.series.Series'>

In [35]:
qqq = df.loc[lambda df: df['three']=='a']
qqq1 = df.loc[df['three']=='a']
print(qqq1)
print(type(qqq))

    name  mass_to_earth three
0  Earth          1.000     a
1   Moon          0.606     a
<class 'pandas.core.frame.DataFrame'>

In [42]:
# df.loc[df['three']=='a'].unique() так не получается, потому что обращаемся к ДатаФрейму, 
#а метод unique считает уникальные значения в столбце

ua = df.loc[df['three'] == 'a', 'name'].unique()
print(type(ua))
print(ua)

<class 'numpy.ndarray'>
['Earth' 'Moon']

In [44]:
ub = df['mass_to_earth'].unique()
print(ub)

[1.    0.606 0.107]

In [46]:
uc = ub.sum()
print(uc)

1.7129999999999999

In [48]:
#ub.count() так нельзя, метод unique() возвращает массив, нужо запрашивать его длину
ud = len(ub)
print(ud)

3

не понятно. 
когда в одном столбце присутствует хотя бы одна строка, None определяется как None. Если в столбце только числа, None становится NaN

In [97]:
dfnul = pd.DataFrame({'name' : ['Earth', 0.1, None],
                   'mass_to_earth' : [1, 2, None],
                   'three' : ['a', 'a', 'b']

                   })
dfnul

    name  mass_to_earth three
0  Earth            1.0     a
1    0.1            2.0     a
2   None            NaN     b

In [89]:
dfnul['mass_to_earth'][2] / 0

nan

In [90]:
dfnul['name'][2] / 0

TypeError: unsupported operand type(s) for /: 'NoneType' and 'int'

In [83]:
dfnul.isna() #isna() и isnull() - одно и то же (В документации про метод isnull написано: Alias of isna.)

    name  mass_to_earth  three
0  False          False  False
1  False          False  False
2  False          False  False

In [62]:
dfnul.isnull().sum()

name             0
mass_to_earth    1
three            0
dtype: int64

In [65]:
dfnul['mass_to_earth'].isnull().sum()

1

In [95]:
import math
dfnan = pd.DataFrame({'name' : ['Earth', 'Moon', 'Mars'],
                   'mass_to_earth' : [1, 0.606, float('NaN')],
                   'three' : ['a', 'a', 'b']

                   })
dfnan

    name  mass_to_earth three
0  Earth          1.000     a
1   Moon          0.606     a
2   Mars            NaN     b

In [78]:
dfnan.isnull().sum()

name             0
mass_to_earth    1
three            0
dtype: int64

In [93]:
dfnulfillna = dfnul.fillna('replaced')
dfnulfillna

       name mass_to_earth three
0     Earth           1.0     a
1       0.1           2.0     a
2  replaced      replaced     b

In [94]:
dfnanfillna = dfnan.fillna('replaced')
dfnanfillna

    name mass_to_earth three
0  Earth           1.0     a
1   Moon         0.606     a
2   Mars      replaced     b

In [99]:
dfdrop = dfnul.dropna()
dfdrop

    name  mass_to_earth three
0  Earth            1.0     a
1    0.1            2.0     a

In [100]:
dfdropnan = dfnan.dropna()
dfdropnan

    name  mass_to_earth three
0  Earth          1.000     a
1   Moon          0.606     a

In [124]:
dfgroup = df = pd.DataFrame({'name' : ['Earth', 'Moon', 'Mars', 'Earth'],
                   'mass_to_earth' : [1, 0.606, 0.107, 4],
                   'three' : ['a', 'a', 'b', 'c']

                   })
dfgroup.groupby('name')['name'].count() # считаем, сколько раз строка со значением "Earth" в столбце name появлялась в таблице

name
Earth    2
Mars     1
Moon     1
Name: name, dtype: int64

In [116]:
dfgroup.groupby('name')['mass_to_earth'].sum() # считаем суммарным итогом значения по массе, которые встречаются в тех строках, 
                                                  # где name = Earth

name
Earth    5.000
Mars     0.107
Moon     0.606
Name: mass_to_earth, dtype: float64

In [118]:
print(type(dfgroup.groupby('name'))) # новый класс - DataFrameGroupBy

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

метод value_counts работает так же, как groupby, но на выходе - знакомый Series

In [123]:
print(type(dfgroup.value_counts()))
print(dfgroup.value_counts())

<class 'pandas.core.series.Series'>
name   mass_to_earth  three
Earth  1.000          a        1
       4.000          c        1
Mars   0.107          b        1
Moon   0.606          a        1
dtype: int64

In [121]:
dfgroup['name'].value_counts()

Earth    2
Moon     1
Mars     1
Name: name, dtype: int64

In [154]:
#d = ['Earth', 'Mars', 'Moon', 'Venus', 'Jupyter'],
 #    [1, 2, 3, 4, 5],
 #    [10, 20, 30, 40, 50],
  #   [100, 200, 300, 400, 500],
  #   [1000, 2000, 3000, 4000, 5000]
#    }
d = [
    ['Earth', 1, 10, 100, 1000],
    ['Mars', 2, 20, 200, 2000],
    ['Moon', 3, 30, 300, 3000],
    ['Venus', 4, 40, 400, 4000],
    ['Earth', 5, 50, 500, 5000]
    ]
df_n = pd.DataFrame(d, columns = ['name', 'ones', 'tens', 'hundgeds', 'thousends'])
df_n

    name  ones  tens  hundgeds  thousends
0  Earth     1    10       100       1000
1   Mars     2    20       200       2000
2   Moon     3    30       300       3000
3  Venus     4    40       400       4000
4  Earth     5    50       500       5000

In [155]:
df_n_g = df_n.groupby('name')
print(df_n_g)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0C4C2B20>

In [156]:
ggg = df_n_g.agg({'tens':['mean', 'median', 'sum']})
print(type(ggg))
print(ggg)

<class 'pandas.core.frame.DataFrame'>
      tens
      mean median sum
name
Earth   30     30  60
Mars    20     20  20
Moon    30     30  30
Venus   40     40  40

In [161]:
import os
print(os.getcwd())
print(os.name)
print(os.listdir())
print(os.listdir(r'C:\\'))

C:\Users\user001\YandexDisk\jupyter_notebook
nt
['.ipynb_checkpoints', 'pandas_park.ipynb', 'Untitled.ipynb']
['$360Section', '$Recycle.Bin', '1AD3049D1CB6', '360SANDBOX', '4c0fec9bc22ec58ee3a9c9d19e', 'bp7', 'Config.Msi', 'Documents and Settings', 'DRIVERS', 'hiberfil.sys', 'Intel', 'kd3test', 'pagefile.sys', 'PerfLogs', 'Program Files', 'Program Files (x86)', 'ProgramData', 'Python', 'Recovery', 'setup.log', 'SWTOOLS', 'System Volume Information', 'Users', 'Windows', 'РАБОТА']

In [166]:
from pymystem3 import Mystem
from collections import Counter
m = Mystem()

ModuleNotFoundError: No module named 'pymystem3'